espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_adi.h
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK8B1213 register.
//
//*****************************************************************************
#define ADI_MASK8B1213_M1_M     0xFF000000  // Mask for ADI register 13
#define ADI_MASK8B1213_M1_S     24
#define ADI_MASK8B1213_D1_M     0x00FF0000  // Data for ADI register 13, -
                                            // only bits selected by mask M1
                                            // will be affected by access
#define ADI_MASK8B1213_D1_S     16
#define ADI_MASK8B1213_M0_M     0x0000FF00  // Mask for ADI register 12
#define ADI_MASK8B1213_M0_S     8
#define ADI_MASK8B1213_D0_M     0x000000FF  // Data for ADI register 12, -
                                            // only bits selected by mask M0
                                            // will be affected by access
#define ADI_MASK8B1213_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK8B1415 register.
//
//*****************************************************************************
#define ADI_MASK8B1415_M1_M     0xFF000000  // Mask for ADI register 15
#define ADI_MASK8B1415_M1_S     24
#define ADI_MASK8B1415_D1_M     0x00FF0000  // Data for ADI register 15, -
                                            // only bits selected by mask M1
                                            // will be affected by access
#define ADI_MASK8B1415_D1_S     16
#define ADI_MASK8B1415_M0_M     0x0000FF00  // Mask for ADI register 14
#define ADI_MASK8B1415_M0_S     8
#define ADI_MASK8B1415_D0_M     0x000000FF  // Data for ADI register 14, -
                                            // only bits selected by mask M0
                                            // will be affected by access
#define ADI_MASK8B1415_D0_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK16B01 register.
//
//*****************************************************************************
#define ADI_MASK16B01_M_M       0xFFFF0000  // Mask for ADI register 0 and 1
#define ADI_MASK16B01_M_S       16
#define ADI_MASK16B01_D_M       0x0000FFFF  // Data for ADI register at
                                            // offsets 0 and 1, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define ADI_MASK16B01_D_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK16B23 register.
//
//*****************************************************************************
#define ADI_MASK16B23_M_M       0xFFFF0000  // Mask for ADI register 2 and 3
#define ADI_MASK16B23_M_S       16
#define ADI_MASK16B23_D_M       0x0000FFFF  // Data for ADI register at
                                            // offsets 2 and 3, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define ADI_MASK16B23_D_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK16B45 register.
//
//*****************************************************************************
#define ADI_MASK16B45_M_M       0xFFFF0000  // Mask for ADI register 4 and 5
#define ADI_MASK16B45_M_S       16
#define ADI_MASK16B45_D_M       0x0000FFFF  // Data for ADI register at
                                            // offsets 4 and 5, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define ADI_MASK16B45_D_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK16B67 register.
//
//*****************************************************************************
#define ADI_MASK16B67_M_M       0xFFFF0000  // Mask for ADI register 6 and 7
#define ADI_MASK16B67_M_S       16
#define ADI_MASK16B67_D_M       0x0000FFFF  // Data for ADI register at
                                            // offsets 6 and 7, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define ADI_MASK16B67_D_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK16B89 register.
//
//*****************************************************************************
#define ADI_MASK16B89_M_M       0xFFFF0000  // Mask for ADI register 8 and 9
#define ADI_MASK16B89_M_S       16
#define ADI_MASK16B89_D_M       0x0000FFFF  // Data for ADI register at
                                            // offsets 8 and 9, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define ADI_MASK16B89_D_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK16B1011 register.
//
//*****************************************************************************
#define ADI_MASK16B1011_M_M     0xFFFF0000  // Mask for ADI register 10 and 11
#define ADI_MASK16B1011_M_S     16
#define ADI_MASK16B1011_D_M     0x0000FFFF  // Data for ADI register at
                                            // offsets 10 and 11, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define ADI_MASK16B1011_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK16B1213 register.
//
//*****************************************************************************
#define ADI_MASK16B1213_M_M     0xFFFF0000  // Mask for ADI register 12 and 13
#define ADI_MASK16B1213_M_S     16
#define ADI_MASK16B1213_D_M     0x0000FFFF  // Data for ADI register at
                                            // offsets 12 and 13, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define ADI_MASK16B1213_D_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_MASK16B1415 register.
//
//*****************************************************************************
#define ADI_MASK16B1415_M_M     0xFFFF0000  // Mask for ADI register 14 and 15
#define ADI_MASK16B1415_M_S     16
#define ADI_MASK16B1415_D_M     0x0000FFFF  // Data for ADI register at
                                            // offsets 14 and 15, - only bits
                                            // selected by mask M will be
                                            // affected by access
#define ADI_MASK16B1415_D_S     0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_NONSECWR0 register.
//
//*****************************************************************************
#define ADI_NONSECWR0_ADDR_M    0x000F0000  // ADI register address
#define ADI_NONSECWR0_ADDR_S    16
#define ADI_NONSECWR0_WR_MASK_M 0x0000FF00  // Write mask to ADI register
#define ADI_NONSECWR0_WR_MASK_S 8
#define ADI_NONSECWR0_DATA_M    0x000000FF  // Data to be written to ADI register
#define ADI_NONSECWR0_DATA_S    0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_NONSECWR1 register.
//
//*****************************************************************************
#define ADI_NONSECWR1_ADDR_M    0x000F0000  // ADI register address
#define ADI_NONSECWR1_ADDR_S    16
#define ADI_NONSECWR1_WR_MASK_M 0x0000FF00  // Write mask to ADI register
#define ADI_NONSECWR1_WR_MASK_S 8
#define ADI_NONSECWR1_DATA_M    0x000000FF  // Data to be written to ADI register
#define ADI_NONSECWR1_DATA_S    0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_NONSECWR2 register.
//
//*****************************************************************************
#define ADI_NONSECWR2_ADDR_M    0x000F0000  // ADI register address
#define ADI_NONSECWR2_ADDR_S    16
#define ADI_NONSECWR2_WR_MASK_M 0x0000FF00  // Write mask to ADI register
#define ADI_NONSECWR2_WR_MASK_S 8
#define ADI_NONSECWR2_DATA_M    0x000000FF  // Data to be written to ADI register
#define ADI_NONSECWR2_DATA_S    0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_NONSECWR3 register.
//
//*****************************************************************************
#define ADI_NONSECWR3_ADDR_M    0x000F0000  // ADI register address
#define ADI_NONSECWR3_ADDR_S    16
#define ADI_NONSECWR3_WR_MASK_M 0x0000FF00  // Write mask to ADI register
#define ADI_NONSECWR3_WR_MASK_S 8
#define ADI_NONSECWR3_DATA_M    0x000000FF  // Data to be written to ADI register
#define ADI_NONSECWR3_DATA_S    0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_NONSECWR4 register.
//
//*****************************************************************************
#define ADI_NONSECWR4_ADDR_M    0x000F0000  // ADI register address
#define ADI_NONSECWR4_ADDR_S    16
#define ADI_NONSECWR4_WR_MASK_M 0x0000FF00  // Write mask to ADI register
#define ADI_NONSECWR4_WR_MASK_S 8
#define ADI_NONSECWR4_DATA_M    0x000000FF  // Data to be written to ADI register
#define ADI_NONSECWR4_DATA_S    0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_NONSECWR5 register.
//
//*****************************************************************************
#define ADI_NONSECWR5_ADDR_M    0x000F0000  // ADI register address
#define ADI_NONSECWR5_ADDR_S    16
#define ADI_NONSECWR5_WR_MASK_M 0x0000FF00  // Write mask to ADI register
#define ADI_NONSECWR5_WR_MASK_S 8
#define ADI_NONSECWR5_DATA_M    0x000000FF  // Data to be written to ADI register
#define ADI_NONSECWR5_DATA_S    0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_NONSECWR6 register.
//
//*****************************************************************************
#define ADI_NONSECWR6_ADDR_M    0x000F0000  // ADI register address
#define ADI_NONSECWR6_ADDR_S    16
#define ADI_NONSECWR6_WR_MASK_M 0x0000FF00  // Write mask to ADI register
#define ADI_NONSECWR6_WR_MASK_S 8
#define ADI_NONSECWR6_DATA_M    0x000000FF  // Data to be written to ADI register
#define ADI_NONSECWR6_DATA_S    0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_NONSECWR7 register.
//
//*****************************************************************************
#define ADI_NONSECWR7_ADDR_M    0x000F0000  // ADI register address
#define ADI_NONSECWR7_ADDR_S    16
#define ADI_NONSECWR7_WR_MASK_M 0x0000FF00  // Write mask to ADI register
#define ADI_NONSECWR7_WR_MASK_S 8
#define ADI_NONSECWR7_DATA_M    0x000000FF  // Data to be written to ADI register
#define ADI_NONSECWR7_DATA_S    0


//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_NONSECCMD register.
//
//*****************************************************************************
#define ADI_NONSECCMD_ADDR_M    0x00000007  // Write ID value in range 0 through
                                            // 7 to perform 8-bit ADI masked
                                            // write as defined by [NONSECWRn].
                                            // Read returns 0.
#define ADI_NONSECCMD_ADDR_S    0

#endif // __HW_ADI_H__
